{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"config": {"trainable": true, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "padding": "same", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "dilation_rate": [1, 1], "batch_input_shape": [null, 64, 64, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [8, 8], "name": "max_pooling2d_3", "strides": [8, 8], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "activation": "linear", "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential"}